@extends('layouts.app')

@section('title', 'Обо мне')

@section('content')
    <section class="page-title">
        <h1>Обо мне</h1>
    </section>

    <section class="two-columns">
        <div class="col">
            <p>
                Меня зовут Гордиенко Денис Олегович. Я родился 4 мая 2006 года
                в городе Красноперекопск, Республика Крым. С самого детства
                меня интересовали техника и компьютеры, поэтому я всегда старался
                углублённо изучать всё, что связано с IT.
            </p>
            <h2>Образование</h2>
            <p>
                С 2012 по 2023 год я учился в МБОУ СОШ №3 города Красноперекопск.
                За годы учёбы мне удалось проявить себя не только в учёбе, но и в
                общественной жизни школы: я принимал участие в школьных проектах,
                олимпиадах по информатике и математике, участвовал в различных
                спортивных соревнованиях. Учителя отмечали мою дисциплинированность,
                любознательность и умение работать в команде.
            </p>
            <p>
                В 2023 году я поступил в Севастопольский государственный университет
                на специальность &laquo;Программная инженерия&raquo;. Сейчас я активно
                изучаю программирование, алгоритмы, разработку приложений. Мне нравится
                разбираться в сложных задачах и находить оптимальные решения.
                Кроме учебы, я стараюсь развивать свои навыки самостоятельно, работаю
                над небольшими проектами и планирую участвовать в хакатонах и
                конкурсах IT-направления.
            </p>
        </div>

        <div class="col">
            <h2>Семья</h2>
            <p>
                Семейное положение - холост. Моя семья - это моя опора и поддержка:
            </p>
            <p>
                Мать - Гордиенко(Базышина) Виктория Валериевна, родилась 4 сентября
                1976 года в Красноперекопске, работает индивидуальным предпринимателем.
            </p>
            <p>
                Отец - Гордиенко Олег Николаевич, родился 13 октября 1975 года в Красноперекопске,
                тоже индивидуальный предприниматель.
            </p>
            <p>
                В будущем я планирую развивать свои знания в области программирования, участвовать
                в крупных IT-проектах и создавать собственные программные продукты. Также хочу внести
                вклад в развитие технологий в России и помогать другим людям с помощью современных
                цифровых решений.
            </p>
        </div>
    </section>
@endsection
