src/app/Http/Middleware/TrackVisitMiddleware.php

    public function handle(Request $request, Closure $next)
    {
        $response = $next($request);

        if ($request->isMethod('GET')) {
            try {
                $ip = $request->ip();
                $hostname = gethostbyaddr($ip);

                PageVisit::create([
                    'visited_at' => now(),
                    'page'       => $request->fullUrl(),
                    'ip_address' => $ip,
                    'hostname'   => $hostname !== $ip ? $hostname : null,
                    'user_agent' => $request->userAgent(),
                ]);
---
insert into `page_visits` (`visited_at`, `page`, `ip_address`, `hostname`, `user_agent`) values ('2026-05-03 20:40:49', 'http://localhost/blog', '172.18.0.1', null, 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/147.0.0.0 Safari/537.36')