<?php

namespace App\Http\Requests;

use Illuminate\Foundation\Http\FormRequest;
use Illuminate\Validation\Rule;

class TestFormRequest extends FormRequest
{
    const ALLOWED_GROUPS = [
        'ИБ/б-25-1-о', 'ИБ/б-25-2-о', 'ИИ/б-25-1-о', 'ИИ/б-25-2-о',
        'ИИ/б-25-3-о', 'ИИ/б-25-4-о', 'ИИ/б-25-5-о', 'ИИ/б-25-6-о',
        'ИИ/б-25-7-о', 'ИИ/б-25-8-о', 'УТС/б-25-1-о', 'ЦТ/б-25-1-о',

        'УТС/б-24-1-о', 'ИБ/б-24-1-о', 'ИБ/б-24-2-о', 'ИТ/б-24-1-о',
        'ИТ/б-24-2-о', 'ИТ/б-24-3-о', 'ИТ/б-24-4-о', 'ИТ/б-24-5-о',
        'ИТ/б-24-6-о', 'ИТ/б-24-7-о', 'ИТ/б-24-8-о', 'ЦТ/б-24-1-о',

        'УТС/б-23-1-о', 'УТС/б-23-2-о', 'ИБ/б-23-1-о', 'ИБ/б-23-2-о',
        'ИВТ/б-23-1-о', 'ИВТ/б-23-2-о', 'ИС/б-23-1-о', 'ИС/б-23-2-о',
        'ПИ/б-23-1-о', 'ПИ/б-23-2-о', 'ПИН/б-23-1-о', 'ПИН/б-23-2-о',

        'ИБ/б-22-1-о', 'ИБ/б-22-2-о', 'ИВТ/б-22-1-о', 'ИВТ/б-22-2-о',
        'ИС/б-22-1-о', 'ИС/б-22-2-о', 'ПИ/б-22-1-о', 'ПИ/б-22-2-о',
        'ПИН/б-22-1-о', 'ПИН/б-22-2-о', 'УТС/б-22-1-о', 'УТС/б-22-2-о',
    ];

    const ALLOWED_Q2_ANSWERS = [
        'Сила',
        'Масса',
        'Скорость',
        'Время',
    ];

    const ALLOWED_Q3_ANSWERS = [
        'Закон Ньютона',
        'Закон сохранения импульса',
        'Закон Ома',
        'Закон Кулона',
    ];

    public function authorize(): bool
    {
        return true;
    }

    public function rules(): array
    {
        return [
            'fullname' => [
                'required',
                'string',
                'regex:/^[А-Яа-яЁё]+\s[А-Яа-яЁё]+\s[А-Яа-яЁё]+$/u',
            ],

            'group' => ['required', Rule::in(SELF::ALLOWED_GROUPS)],

            'q1' => ['required', 'string'],

            'q2'   => ['required', 'array', 'size:2'],
            'q2.*' => ['string', Rule::in(SELF::ALLOWED_Q2_ANSWERS)],

            'q3' => ['required', 'string', Rule::in(SELF::ALLOWED_Q3_ANSWERS)],
        ];
    }

    public function messages(): array
    {
        return [
            'fullname.required' => 'Введите ФИО.',
            'fullname.regex'    => 'ФИО должно содержать три слова на кириллице.',

            'group.required' => 'Выберите группу.',
            'group.in'       => 'Выбранная группа недопустима.',

            'q1.required' => 'Введите ответ на первый вопрос.',

            'q2.required' => 'Выберите ответы на второй вопрос.',
            'q2.array'    => 'Некорректный формат ответа на второй вопрос.',
            'q2.size'     => 'Необходимо выбрать ровно 2 варианта.',
            'q2.*.in'     => 'Один из выбранных ответов недопустим.',

            'q3.required' => 'Выберите ответ на третий вопрос.',
            'q3.in'       => 'Выбранный ответ недопустим.',
        ];
    }
}
