src/app/Http/Controllers/BlogController.php

    public function index()
    {
        $posts = BlogPost::orderByDesc('created_at')->paginate(5);
---
select * from `blog_posts` order by `created_at` desc limit 5 offset 0
select count(*) as aggregate from `blog_posts`