src/app/Http/Controllers/BlogCommentController.php

    public function index(Request $request, $postId)
    {
        $comments = Comment::where('blog_post_id', $postId)
            ->with('user:id,name,last_name,first_name')
            ->latest()
            ->get()
            ->map(function ($comment) {
                return [
                    'id'     => $comment->id,
                    'author' => $comment->user->full_name ?? $comment->user->name,
                    'text'   => $comment->text,
                    'date'   => $comment->created_at->format('d.m.Y H:i'),
                ];
            });
---
select * from `comments` where `blog_post_id` = 1 order by `created_at` desc
select `id`, `name`, `last_name`, `first_name` from `users` where `users`.`id` in (1)